[Killed] ObjectLiteral
src/app.js:7:39
 
 //luodaan taskRepo ja taskService ilmentymät
 const taskRepo = createTaskRepo();
-const taskService = createTaskService({ taskRepo });
+const taskService = createTaskService({});
 
 //import Express
killedBy: POST /tasks creating a task with valid data succeeds
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 500

[Killed] BlockStatement
src/app.js:20:34
 app.use(express.static("public"));
 
 //Checkpoint, verifioidaan että app toimii
-app.get("/health", (req, res) => {
-  res.json({ status: "ok" });
-});
+app.get("/health", (req, res) => {});
 //POST /tasks luo uuden tehtävän
 app.post("/tasks", async (req, res, next) => {
killedBy: GET /health returns status ok
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] StringLiteral
src/app.js:20:9
 app.use(express.static("public"));
 
 //Checkpoint, verifioidaan että app toimii
-app.get("/health", (req, res) => {
+app.get("", (req, res) => {
   res.json({ status: "ok" });
 });
killedBy: GET /health returns status ok
statusReason: Error: expected 200 "OK", got 404 "Not Found"

[Timeout] BlockStatement
src/app.js:24:46
   res.json({ status: "ok" });
 });
 //POST /tasks luo uuden tehtävän
-app.post("/tasks", async (req, res, next) => {
-  try {
-    const created = await taskService.createTask(req.body);
-    res.status(201).json(created);
-  } catch (err) {
-    next(err);
-  }
-});
+app.post("/tasks", async (req, res, next) => {});
 //GET /tasks palauttaa kaikki tehtävät
 app.get("/tasks", async (req, res, next) => {

[Killed] StringLiteral
src/app.js:24:10
   res.json({ status: "ok" });
 });
 //POST /tasks luo uuden tehtävän
-app.post("/tasks", async (req, res, next) => {
+app.post("", async (req, res, next) => {
   try {
     const created = await taskService.createTask(req.body);
killedBy: POST /tasks creating a task with valid data succeeds
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 404

[Timeout] BlockStatement
src/app.js:25:7
 });
 //POST /tasks luo uuden tehtävän
 app.post("/tasks", async (req, res, next) => {
-  try {
-    const created = await taskService.createTask(req.body);
-    res.status(201).json(created);
-  } catch (err) {
+  try {} catch (err) {
     next(err);
   }

[Timeout] BlockStatement
src/app.js:28:17
   try {
     const created = await taskService.createTask(req.body);
     res.status(201).json(created);
-  } catch (err) {
-    next(err);
-  }
+  } catch (err) {}
 });
 //GET /tasks palauttaa kaikki tehtävät

[Timeout] BlockStatement
src/app.js:33:45
   }
 });
 //GET /tasks palauttaa kaikki tehtävät
-app.get("/tasks", async (req, res, next) => {
-  try {
-    const tasks = await taskService.listTasks();
-    res.json(tasks);
-  } catch (err) {
-    next(err);
-  }
-});
+app.get("/tasks", async (req, res, next) => {});
 //GET /tasks/:id palauttaa tehtävän id:llä
 app.get("/tasks/:id", async (req, res, next) => {

[Timeout] BlockStatement
src/app.js:34:7
 });
 //GET /tasks palauttaa kaikki tehtävät
 app.get("/tasks", async (req, res, next) => {
-  try {
-    const tasks = await taskService.listTasks();
-    res.json(tasks);
-  } catch (err) {
+  try {} catch (err) {
     next(err);
   }

[NoCoverage] BlockStatement
src/app.js:37:17
   try {
     const tasks = await taskService.listTasks();
     res.json(tasks);
-  } catch (err) {
-    next(err);
-  }
+  } catch (err) {}
 });
 //GET /tasks/:id palauttaa tehtävän id:llä

[Timeout] BlockStatement
src/app.js:42:49
   }
 });
 //GET /tasks/:id palauttaa tehtävän id:llä
-app.get("/tasks/:id", async (req, res, next) => {
-  try {
-    const task = await taskService.getTask(req.params.id);
-    res.json(task);
-  } catch (err) {
-    next(err);
-  }
-});
+app.get("/tasks/:id", async (req, res, next) => {});
 //PATCH /tasks/:id päivittää tehtävän id:llä
 app.patch("/tasks/:id", async (req, res, next) => {

[Timeout] BlockStatement
src/app.js:43:7
 });
 //GET /tasks/:id palauttaa tehtävän id:llä
 app.get("/tasks/:id", async (req, res, next) => {
-  try {
-    const task = await taskService.getTask(req.params.id);
-    res.json(task);
-  } catch (err) {
+  try {} catch (err) {
     next(err);
   }

[Timeout] BlockStatement
src/app.js:46:17
   try {
     const task = await taskService.getTask(req.params.id);
     res.json(task);
-  } catch (err) {
-    next(err);
-  }
+  } catch (err) {}
 });
 //PATCH /tasks/:id päivittää tehtävän id:llä

[Timeout] BlockStatement
src/app.js:51:51
   }
 });
 //PATCH /tasks/:id päivittää tehtävän id:llä
-app.patch("/tasks/:id", async (req, res, next) => {
-  try {
-    const updated = await taskService.updateTask(req.params.id, req.body);
-    res.json(updated);
-  } catch (err) {
-    next(err);
-  }
-});
+app.patch("/tasks/:id", async (req, res, next) => {});
 //DELETE /tasks/:id poistaa tehtävän id:llä
 app.delete("/tasks/:id", async (req, res, next) => {

[Timeout] BlockStatement
src/app.js:52:7
 });
 //PATCH /tasks/:id päivittää tehtävän id:llä
 app.patch("/tasks/:id", async (req, res, next) => {
-  try {
-    const updated = await taskService.updateTask(req.params.id, req.body);
-    res.json(updated);
-  } catch (err) {
+  try {} catch (err) {
     next(err);
   }

[Timeout] BlockStatement
src/app.js:55:17
   try {
     const updated = await taskService.updateTask(req.params.id, req.body);
     res.json(updated);
-  } catch (err) {
-    next(err);
-  }
+  } catch (err) {}
 });
 //DELETE /tasks/:id poistaa tehtävän id:llä

[Timeout] BlockStatement
src/app.js:60:52
   }
 });
 //DELETE /tasks/:id poistaa tehtävän id:llä
-app.delete("/tasks/:id", async (req, res, next) => {
-  try {
-    await taskService.deleteTask(req.params.id);
-    res.status(204).send();
-  } catch (err) {
-    next(err);
-  }
-});
+app.delete("/tasks/:id", async (req, res, next) => {});
 //error handling middleware
 app.use((err, req, res, next) => {

[Timeout] BlockStatement
src/app.js:61:7
 });
 //DELETE /tasks/:id poistaa tehtävän id:llä
 app.delete("/tasks/:id", async (req, res, next) => {
-  try {
-    await taskService.deleteTask(req.params.id);
-    res.status(204).send();
-  } catch (err) {
+  try {} catch (err) {
     next(err);
   }

[Timeout] BlockStatement
src/app.js:64:17
   try {
     await taskService.deleteTask(req.params.id);
     res.status(204).send();
-  } catch (err) {
-    next(err);
-  }
+  } catch (err) {}
 });
 //error handling middleware

[Timeout] BlockStatement
src/app.js:69:34
   }
 });
 //error handling middleware
-app.use((err, req, res, next) => {
-  void next;
-  if (err.name === "ValidationError") {
-    return res.status(400).json({ error: err.message });
-  }
-  if (err.name === "NotFoundError") {
-    return res.status(404).json({ error: err.message });
-  }
-  return res.status(500).json({ error: "Internal Server Error" });
-});
+app.use((err, req, res, next) => {});
 
 module.exports = app;

[Killed] BlockStatement
src/app.js:71:39
 //error handling middleware
 app.use((err, req, res, next) => {
   void next;
-  if (err.name === "ValidationError") {
-    return res.status(400).json({ error: err.message });
-  }
+  if (err.name === "ValidationError") {}
   if (err.name === "NotFoundError") {
     return res.status(404).json({ error: err.message });
killedBy: POST /tasks creating a task with invalid status fails
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 500

[Killed] ConditionalExpression
src/app.js:71:7
 //error handling middleware
 app.use((err, req, res, next) => {
   void next;
-  if (err.name === "ValidationError") {
+  if (true) {
     return res.status(400).json({ error: err.message });
   }
killedBy: Get /tasks/:id with non-existing id returns 404
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 404
Received: 400

[Killed] BlockStatement
src/app.js:74:37
   if (err.name === "ValidationError") {
     return res.status(400).json({ error: err.message });
   }
-  if (err.name === "NotFoundError") {
-    return res.status(404).json({ error: err.message });
-  }
+  if (err.name === "NotFoundError") {}
   return res.status(500).json({ error: "Internal Server Error" });
 });
killedBy: Get /tasks/:id with non-existing id returns 404
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 404
Received: 500

[Killed] EqualityOperator
src/app.js:74:7
   if (err.name === "ValidationError") {
     return res.status(400).json({ error: err.message });
   }
-  if (err.name === "NotFoundError") {
+  if (err.name !== "NotFoundError") {
     return res.status(404).json({ error: err.message });
   }
killedBy: Get /tasks/:id with non-existing id returns 404
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 404
Received: 500
