[Killed] BlockStatement
src/tasks/errors.js:6:25
 tai api-kutsun datan vääryyden
 */
 class ValidationError extends Error {
-    constructor(message){
-        super(message);
-        this.name="ValidationError"
-    }
+    constructor(message){}
 }
 class NotFoundError extends Error {
killedBy: POST /tasks creating a task with invalid status fails
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 500

[Killed] StringLiteral
src/tasks/errors.js:8:19
 class ValidationError extends Error {
     constructor(message){
         super(message);
-        this.name="ValidationError"
+        this.name=""
     }
 }
killedBy: POST /tasks creating a task with invalid status fails
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 500

[Killed] BlockStatement
src/tasks/errors.js:12:24
     }
 }
 class NotFoundError extends Error {
-  constructor(message) {
-    super(message);
-    this.name = "NotFoundError";
-  }
+  constructor(message) {}
 }
 
killedBy: Get /tasks/:id with non-existing id returns 404
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 404
Received: 500

[Killed] ObjectLiteral
src/tasks/errors.js:19:16
 }
 
 
-module.exports={
-    ValidationError,
-    NotFoundError,
-};
+module.exports={};
 
killedBy: POST /tasks creating a task with invalid status fails
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 500
