[Killed] BlockStatement
src/tasks/taskRepo.memory.js:4:16
 /*
 Taskien data access
 */
-function now() {
-  return new Date().toISOString();
-}
+function now() {}
 
 function createTaskRepoMemory() {
killedBy: TaskRepoMemory create() stores and returns a task with id
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Killed] BlockStatement
src/tasks/taskRepo.memory.js:14:24
   let nextId = 1;
 
   return {
-    async create(task) {
-      const id = String(nextId);
-      nextId = nextId + 1;
-
-      const createdTask = {
-        id,
-        title: task.title,
-        status: task.status ?? "todo", //use default only if null
-        createdAt: now(),
-        updatedAt: now(),
-      };
-
-      tasksById.set(id, createdTask);
-      return createdTask;
-    },
+    async create(task) {},
 
     async findById(id) {
killedBy: POST /tasks creating a task with valid data succeeds
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Test Task"
Received: undefined

[Survived] ArithmeticOperator
src/tasks/taskRepo.memory.js:16:16
   return {
     async create(task) {
       const id = String(nextId);
-      nextId = nextId + 1;
+      nextId = nextId - 1;
 
       const createdTask = {

[Killed] ObjectLiteral
src/tasks/taskRepo.memory.js:18:27
       const id = String(nextId);
       nextId = nextId + 1;
 
-      const createdTask = {
-        id,
-        title: task.title,
-        status: task.status ?? "todo", //use default only if null
-        createdAt: now(),
-        updatedAt: now(),
-      };
+      const createdTask = {};
 
       tasksById.set(id, createdTask);
killedBy: POST /tasks creating a task with valid data succeeds
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Test Task"
Received: undefined

[Killed] LogicalOperator
src/tasks/taskRepo.memory.js:21:17
       const createdTask = {
         id,
         title: task.title,
-        status: task.status ?? "todo", //use default only if null
+        status: task.status && "todo", //use default only if null
         createdAt: now(),
         updatedAt: now(),
killedBy: POST /tasks with in_progress status succeeds
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "in_progress"
Received: "todo"

[Killed] StringLiteral
src/tasks/taskRepo.memory.js:21:32
       const createdTask = {
         id,
         title: task.title,
-        status: task.status ?? "todo", //use default only if null
+        status: task.status ?? "", //use default only if null
         createdAt: now(),
         updatedAt: now(),
killedBy: TaskRepoMemory create() stores and returns a task with id
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "todo"
Received: ""

[Killed] BlockStatement
src/tasks/taskRepo.memory.js:30:24
       return createdTask;
     },
 
-    async findById(id) {
-      //use default only if null
-      return tasksById.get(id) ?? null;
-    },
+    async findById(id) {},
 
     async list() {
killedBy: Get /tasks/:id returns created task
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Killed] LogicalOperator
src/tasks/taskRepo.memory.js:32:14
 
     async findById(id) {
       //use default only if null
-      return tasksById.get(id) ?? null;
+      return tasksById.get(id) && null;
     },
 
killedBy: Get /tasks/:id returns created task
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Killed] BlockStatement
src/tasks/taskRepo.memory.js:35:18
       return tasksById.get(id) ?? null;
     },
 
-    async list() {
-      return Array.from(tasksById.values());
-    },
+    async list() {},
 
     async update(id, patch) {
killedBy: GET /tasks returns an array
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/tasks/taskRepo.memory.js:39:29
       return Array.from(tasksById.values());
     },
 
-    async update(id, patch) {
-      const current = tasksById.get(id);
-      if (!current) return null;
-
-      const updated = {
-        ...current,
-        ...patch,
-        id: current.id, // protect id
-        updatedAt: now(),
-      };
-
-      tasksById.set(id, updated);
-      return updated;
-    },
+    async update(id, patch) {},
 
     async remove(id) {
killedBy: TaskRepoMemory update() updates fields and returns updated task; null if missing
statusReason: TypeError: Cannot read properties of undefined (reading 'title')

[Killed] ConditionalExpression
src/tasks/taskRepo.memory.js:41:11
 
     async update(id, patch) {
       const current = tasksById.get(id);
-      if (!current) return null;
+      if (true) return null;
 
       const updated = {
killedBy: PATCH /tasks/:id updates task status
statusReason: Error: expected 200 "OK", got 404 "Not Found"

[Killed] BooleanLiteral
src/tasks/taskRepo.memory.js:41:11
 
     async update(id, patch) {
       const current = tasksById.get(id);
-      if (!current) return null;
+      if (current) return null;
 
       const updated = {
killedBy: PATCH /tasks/:id updates task status
statusReason: Error: expected 200 "OK", got 404 "Not Found"

[Killed] ObjectLiteral
src/tasks/taskRepo.memory.js:43:23
       const current = tasksById.get(id);
       if (!current) return null;
 
-      const updated = {
-        ...current,
-        ...patch,
-        id: current.id, // protect id
-        updatedAt: now(),
-      };
+      const updated = {};
 
       tasksById.set(id, updated);
killedBy: PATCH /tasks/:id updates task status
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "done"
Received: undefined

[Killed] BlockStatement
src/tasks/taskRepo.memory.js:54:22
       return updated;
     },
 
-    async remove(id) {
-      return tasksById.delete(id);
-    },
+    async remove(id) {},
   };
 }
killedBy: TaskRepoMemory remove() returns true if deleted, false if missing
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined
