[Killed] StringLiteral
src/tasks/taskService.js:4:43
 const {ValidationError,NotFoundError }=require("./errors");
 
 
-const ALLOWED_STATUSES = new Set(["todo", "in_progress", "done"]);
+const ALLOWED_STATUSES = new Set(["todo", "", "done"]);
 /*
 Tarkastaa onko task kirjoitettu oikein, muuten antaa validationError
killedBy: POST /tasks with in_progress status succeeds
statusReason: Error: expected 201 "Created", got 400 "Bad Request"

[Killed] BlockStatement
src/tasks/taskService.js:8:28
 /*
 Tarkastaa onko task kirjoitettu oikein, muuten antaa validationError
 */
-function validateTask(task){
-    //yrittää lukea titlen JOS task on olemassa
-    const title=task?.title;
-
-    //jos title ei ole string, on tyhjä tulee error viesti
-    if (typeof title !== "string" || title.trim().length===0){
-        throw new ValidationError("Task title must be non-empty string");
-    }
-      // status-validointi
-  if (task?.status !== undefined) {
-    const status = task.status;
-
-    if (typeof status !== "string" || !ALLOWED_STATUSES.has(status)) {
-      throw new ValidationError("Invalid status");
-    }
-  }
-
-  return true;
-}
+function validateTask(task){}
 function validateTaskPatch(patch) {
   if (patch.title !== undefined) {
killedBy: POST /tasks creating a task with invalid status fails
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 201

[Survived] OptionalChaining
src/tasks/taskService.js:10:17
 */
 function validateTask(task){
     //yrittää lukea titlen JOS task on olemassa
-    const title=task?.title;
+    const title=task.title;
 
     //jos title ei ole string, on tyhjä tulee error viesti

[Killed] ConditionalExpression
src/tasks/taskService.js:13:9
     const title=task?.title;
 
     //jos title ei ole string, on tyhjä tulee error viesti
-    if (typeof title !== "string" || title.trim().length===0){
+    if (true){
         throw new ValidationError("Task title must be non-empty string");
     }
killedBy: TaskService createTask() calls repo.create and returns created task
statusReason: ValidationError: Task title must be non-empty string

[Killed] BlockStatement
src/tasks/taskService.js:13:62
     const title=task?.title;
 
     //jos title ei ole string, on tyhjä tulee error viesti
-    if (typeof title !== "string" || title.trim().length===0){
-        throw new ValidationError("Task title must be non-empty string");
-    }
+    if (typeof title !== "string" || title.trim().length===0){}
       // status-validointi
   if (task?.status !== undefined) {
killedBy: Smoke Tests Smoke 2: Error Path POST /tasks ilman titleä → 400 + järkevä virheviesti
statusReason: Error: expected 400 "Bad Request", got 201 "Created"

[Killed] StringLiteral
src/tasks/taskService.js:14:35
 
     //jos title ei ole string, on tyhjä tulee error viesti
     if (typeof title !== "string" || title.trim().length===0){
-        throw new ValidationError("Task title must be non-empty string");
+        throw new ValidationError("");
     }
       // status-validointi
killedBy: Smoke Tests Smoke 2: Error Path POST /tasks ilman titleä → 400 + järkevä virheviesti
statusReason: Error: expect(received).toBeTruthy()

Received: ""

[Killed] EqualityOperator
src/tasks/taskService.js:17:7
         throw new ValidationError("Task title must be non-empty string");
     }
       // status-validointi
-  if (task?.status !== undefined) {
+  if (task?.status === undefined) {
     const status = task.status;
 
killedBy: POST /tasks creating a task with invalid status fails
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 201

[Killed] BlockStatement
src/tasks/taskService.js:17:35
         throw new ValidationError("Task title must be non-empty string");
     }
       // status-validointi
-  if (task?.status !== undefined) {
-    const status = task.status;
-
-    if (typeof status !== "string" || !ALLOWED_STATUSES.has(status)) {
-      throw new ValidationError("Invalid status");
-    }
-  }
+  if (task?.status !== undefined) {}
 
   return true;
killedBy: POST /tasks creating a task with invalid status fails
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 201

[Killed] BlockStatement
src/tasks/taskService.js:20:70
   if (task?.status !== undefined) {
     const status = task.status;
 
-    if (typeof status !== "string" || !ALLOWED_STATUSES.has(status)) {
-      throw new ValidationError("Invalid status");
-    }
+    if (typeof status !== "string" || !ALLOWED_STATUSES.has(status)) {}
   }
 
killedBy: POST /tasks creating a task with invalid status fails
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 201

[Killed] LogicalOperator
src/tasks/taskService.js:20:9
   if (task?.status !== undefined) {
     const status = task.status;
 
-    if (typeof status !== "string" || !ALLOWED_STATUSES.has(status)) {
+    if (typeof status !== "string" && !ALLOWED_STATUSES.has(status)) {
       throw new ValidationError("Invalid status");
     }
killedBy: POST /tasks creating a task with invalid status fails
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 201

[Killed] BlockStatement
src/tasks/taskService.js:27:35
 
   return true;
 }
-function validateTaskPatch(patch) {
-  if (patch.title !== undefined) {
-     if (typeof patch.title !== "string" || patch.title.trim().length === 0) {
-      throw new ValidationError("Task title must be non-empty string");
-    }
-  }
-  if (patch.status !== undefined) {
-    if (typeof patch.status !== "string" || !ALLOWED_STATUSES.has(patch.status)) {
-      throw new ValidationError("Invalid status");
-    }
-  }
-  return true;
-} 
+function validateTaskPatch(patch) {} 
 /*
 Logiikka puoli taskeille
killedBy: PATCH /tasks/:id with invalid status returns 400 with error message
statusReason: Error: expected 400 "Bad Request", got 200 "OK"

[Killed] EqualityOperator
src/tasks/taskService.js:28:7
   return true;
 }
 function validateTaskPatch(patch) {
-  if (patch.title !== undefined) {
+  if (patch.title === undefined) {
      if (typeof patch.title !== "string" || patch.title.trim().length === 0) {
       throw new ValidationError("Task title must be non-empty string");
killedBy: PATCH /tasks/:id updates task status
statusReason: Error: expected 200 "OK", got 400 "Bad Request"

[Killed] ConditionalExpression
src/tasks/taskService.js:28:7
   return true;
 }
 function validateTaskPatch(patch) {
-  if (patch.title !== undefined) {
+  if (false) {
      if (typeof patch.title !== "string" || patch.title.trim().length === 0) {
       throw new ValidationError("Task title must be non-empty string");
killedBy: TaskService updateTask() throws ValidationError if patch title is invalid
statusReason: Error: expect(received).rejects.toBeInstanceOf(expected)

Expected constructor: ValidationError
Received constructor: NotFoundError

[Killed] EqualityOperator
src/tasks/taskService.js:29:10
 }
 function validateTaskPatch(patch) {
   if (patch.title !== undefined) {
-     if (typeof patch.title !== "string" || patch.title.trim().length === 0) {
+     if (typeof patch.title === "string" || patch.title.trim().length === 0) {
       throw new ValidationError("Task title must be non-empty string");
     }
killedBy: TaskService updateTask() updates when found
statusReason: ValidationError: Task title must be non-empty string

[Killed] MethodExpression
src/tasks/taskService.js:29:45
 }
 function validateTaskPatch(patch) {
   if (patch.title !== undefined) {
-     if (typeof patch.title !== "string" || patch.title.trim().length === 0) {
+     if (typeof patch.title !== "string" || patch.title.length === 0) {
       throw new ValidationError("Task title must be non-empty string");
     }
killedBy: TaskService updateTask() throws ValidationError if patch title is invalid
statusReason: Error: expect(received).rejects.toBeInstanceOf(expected)

Expected constructor: ValidationError
Received constructor: NotFoundError

[Killed] BlockStatement
src/tasks/taskService.js:33:35
       throw new ValidationError("Task title must be non-empty string");
     }
   }
-  if (patch.status !== undefined) {
-    if (typeof patch.status !== "string" || !ALLOWED_STATUSES.has(patch.status)) {
-      throw new ValidationError("Invalid status");
-    }
-  }
+  if (patch.status !== undefined) {}
   return true;
 } 
killedBy: PATCH /tasks/:id with invalid status returns 400 with error message
statusReason: Error: expected 400 "Bad Request", got 200 "OK"

[Killed] ConditionalExpression
src/tasks/taskService.js:33:7
       throw new ValidationError("Task title must be non-empty string");
     }
   }
-  if (patch.status !== undefined) {
+  if (true) {
     if (typeof patch.status !== "string" || !ALLOWED_STATUSES.has(patch.status)) {
       throw new ValidationError("Invalid status");
killedBy: TaskService updateTask() allows PATCH with only valid title
statusReason: ValidationError: Invalid status

[Killed] BooleanLiteral
src/tasks/taskService.js:34:45
     }
   }
   if (patch.status !== undefined) {
-    if (typeof patch.status !== "string" || !ALLOWED_STATUSES.has(patch.status)) {
+    if (typeof patch.status !== "string" || ALLOWED_STATUSES.has(patch.status)) {
       throw new ValidationError("Invalid status");
     }
killedBy: PATCH /tasks/:id updates task status
statusReason: Error: expected 200 "OK", got 400 "Bad Request"

[Killed] ConditionalExpression
src/tasks/taskService.js:34:9
     }
   }
   if (patch.status !== undefined) {
-    if (typeof patch.status !== "string" || !ALLOWED_STATUSES.has(patch.status)) {
+    if (false) {
       throw new ValidationError("Invalid status");
     }
killedBy: PATCH /tasks/:id with invalid status returns 400 with error message
statusReason: Error: expected 400 "Bad Request", got 200 "OK"

[Killed] StringLiteral
src/tasks/taskService.js:35:33
   }
   if (patch.status !== undefined) {
     if (typeof patch.status !== "string" || !ALLOWED_STATUSES.has(patch.status)) {
-      throw new ValidationError("Invalid status");
+      throw new ValidationError("");
     }
   }
killedBy: PATCH /tasks/:id with invalid status returns 400 with error message
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /[Ii]nvalid|[Ss]tatus/
Received string:  ""

[Killed] BlockStatement
src/tasks/taskService.js:46:28
 function createTaskService({ taskRepo }) {
   return {
     //luo taski, jos se on validi
-    async createTask(task) {
-      validateTask(task);
-      return taskRepo.create(task);
-    },
+    async createTask(task) {},
 
     //etsi taski id perusteella
killedBy: TaskService createTask() calls repo.create and returns created task
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] BlockStatement
src/tasks/taskService.js:52:23
     },
 
     //etsi taski id perusteella
-    async getTask(id) {
-      const task = await taskRepo.findById(id);
-      if (!task) {
-        throw new NotFoundError(`Task with id ${id} not found`);
-      }
-      return task;
-    },
+    async getTask(id) {},
     //listaa taskit
     async listTasks() {
killedBy: Get /tasks/:id returns created task
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "1"
Received: undefined

[Killed] BlockStatement
src/tasks/taskService.js:54:18
     //etsi taski id perusteella
     async getTask(id) {
       const task = await taskRepo.findById(id);
-      if (!task) {
-        throw new NotFoundError(`Task with id ${id} not found`);
-      }
+      if (!task) {}
       return task;
     },
killedBy: Get /tasks/:id with non-existing id returns 404
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 404
Received: 200

[Killed] ConditionalExpression
src/tasks/taskService.js:54:11
     //etsi taski id perusteella
     async getTask(id) {
       const task = await taskRepo.findById(id);
-      if (!task) {
+      if (true) {
         throw new NotFoundError(`Task with id ${id} not found`);
       }
killedBy: Get /tasks/:id returns created task
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Killed] BlockStatement
src/tasks/taskService.js:60:23
       return task;
     },
     //listaa taskit
-    async listTasks() {
-      return taskRepo.list();
-    },
+    async listTasks() {},
     //update taski id perusteella
     async updateTask(id, patch) {
killedBy: GET /tasks returns an array
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/tasks/taskService.js:64:33
       return taskRepo.list();
     },
     //update taski id perusteella
-    async updateTask(id, patch) {
-      validateTaskPatch(patch);
-      const updated = await taskRepo.update(id, patch);
-      if (!updated) {
-        throw new NotFoundError(`Task with id ${id} not found`);
-      }
-      return updated;
-    },
+    async updateTask(id, patch) {},
     //poista taski id perusteella
     async deleteTask(id) {
killedBy: PATCH /tasks/:id updates task status
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "done"
Received: undefined

[Killed] ConditionalExpression
src/tasks/taskService.js:67:11
     async updateTask(id, patch) {
       validateTaskPatch(patch);
       const updated = await taskRepo.update(id, patch);
-      if (!updated) {
+      if (false) {
         throw new NotFoundError(`Task with id ${id} not found`);
       }
killedBy: PATCH /tasks/:id returns 404 for missing id
statusReason: Error: expected 404 "Not Found", got 200 "OK"

[Killed] BooleanLiteral
src/tasks/taskService.js:67:11
     async updateTask(id, patch) {
       validateTaskPatch(patch);
       const updated = await taskRepo.update(id, patch);
-      if (!updated) {
+      if (updated) {
         throw new NotFoundError(`Task with id ${id} not found`);
       }
killedBy: PATCH /tasks/:id updates task status
statusReason: Error: expected 200 "OK", got 404 "Not Found"

[Killed] BlockStatement
src/tasks/taskService.js:73:26
       return updated;
     },
     //poista taski id perusteella
-    async deleteTask(id) {
-      const removed = await taskRepo.remove(id);
-      if (!removed) {
-        throw new NotFoundError(`Task with id ${id} not found`);
-      }
-    },
+    async deleteTask(id) {},
   };
 }
killedBy: DELETE /tasks/:id deletes an existing task
statusReason: Error: expected 404 "Not Found", got 200 "OK"

[Killed] ConditionalExpression
src/tasks/taskService.js:75:11
     //poista taski id perusteella
     async deleteTask(id) {
       const removed = await taskRepo.remove(id);
-      if (!removed) {
+      if (false) {
         throw new NotFoundError(`Task with id ${id} not found`);
       }
killedBy: DELETE /tasks/:id returns 404 for missing id
statusReason: Error: expected 404 "Not Found", got 204 "No Content"

[Killed] ConditionalExpression
src/tasks/taskService.js:75:11
     //poista taski id perusteella
     async deleteTask(id) {
       const removed = await taskRepo.remove(id);
-      if (!removed) {
+      if (true) {
         throw new NotFoundError(`Task with id ${id} not found`);
       }
killedBy: DELETE /tasks/:id deletes an existing task
statusReason: Error: expected 204 "No Content", got 404 "Not Found"
